1.Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame and order by score (highest to lowest).  Sample DataFrame: (i) exam_data = {'name': ['Ali', 'Abu', 'Katherine', 'Site', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'James'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [15]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Ali', 'Abu', 'Katherine', 'Site', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'James'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(exam_data)
df[["name","score"]].sort_values(by='score',ascending=False)

        name  score
5    Michael   20.0
9      James   19.0
2  Katherine   16.5
6    Matthew   14.5
0        Ali   12.5
1        Abu    9.0
4      Emily    9.0
8      Kevin    8.0
3       Site    NaN
7      Laura    NaN

2.Select 'name' , ‘attempts’ and 'score' columns in rows 1, 3, 5, 6
from the above DataFrame (i).

In [4]:
df[["name","attempts","score"]].iloc[[1,3,5,6],]

      name  attempts  score
1      Abu         3    9.0
3     Site         3    NaN
5  Michael         3   20.0
6  Matthew         1   14.5

3

In [6]:
df[df.attempts>2]

      name  score  attempts qualify
1      Abu    9.0         3      no
3     Site    NaN         3      no
5  Michael   20.0         3     yes

4

In [10]:
print("number of rows",len(df))

print("number of columns",len(df.columns))

number of rows 10
number of columns 4

In [ ]:
5

In [11]:
df[df.score.isnull()]

    name  score  attempts qualify
3   Site    NaN         3      no
7  Laura    NaN         1      no

In [ ]:
6.Write a Pandas program to select the rows the score is between 12 and 20 (inclusive).

In [ ]:
df[(df.score>=12)&(df.score<=20)]

7.Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and 
score greater than 10.

In [12]:
df[(df.attempts<2)&(df.score>10)]

      name  score  attempts qualify
0      Ali   12.5         1     yes
6  Matthew   14.5         1     yes
9    James   19.0         1     yes

In [ ]:
8

In [ ]:
df.score.iloc[3] = 11.5

In [ ]:
9

In [ ]:
sum(df.attempts)

10.Write a Pandas program to calculate the mean score for each different student in DataFrame(i) and list out student(s) 
name and score(s) who is/are more than mean score.

In [14]:
df[df.score>df.mean().score].loc[:,['name','score']]

        name  score
2  Katherine   16.5
5    Michael   20.0
6    Matthew   14.5
9      James   19.0